Documents/Маршрут.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Маршрут</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальныеМаршруты</xr:Item>
				<xr:Item>InformationRegister.ЗаданияТП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПосещений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаданияТП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПосещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АктуальныеМаршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АктуальныеМаршруты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияПоАнкетированиюКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияПоАнкетированиюКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаАнкетирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияАнкетирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияТП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалить_ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/АнкетаТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АнкетаТП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Посещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыАнкетДляТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Территории</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ФБ_Базы</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ТипыПосещенийКлиентовТорговымиПредставителями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТипыПосещенийКлиентовТорговымиПредставителями</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИзменениеСпискаЗаданий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаданияТорговомуПредставителю</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗаданийТорговымПредставителям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Маршрут/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Набор = Движения.АктуальныеМаршруты;
	Набор.Очистить();
	Набор.Записывать = Истина;
	
	Запись                       = Набор.Добавить();
	Запись.Маршрут               = Ссылка;
	Запись.ТорговыйПредставитель = ТорговыйПредставитель;
	Запись.Период                = Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутПланПосещений.Контрагент КАК Контрагент,
	|	МаршрутЗадания.ИдентификаторЗадания,
	|	МаршрутЗадания.Ссылка КАК Маршрут,
	|	ВЫБОР
	|		КОГДА МаршрутЗадания.Задание = ""Заказ""
	|			ТОГДА &ВидЗаданияЗаказ
	|		КОГДА МаршрутЗадания.Задание = ""Фото фасада торговой точки""
	|			ТОГДА &ВидЗаданияФотоФасада
	|		КОГДА МаршрутЗадания.Задание = ""Фото полки до мерчандайзинга""
	|			ТОГДА &ВидЗаданияФотоПолкиДоМерчендайзинга
	|		КОГДА МаршрутЗадания.Задание = ""Фото полки после мерчандайзинга""
	|			ТОГДА &ВидЗаданияФотоПолкиПослеМерчендайзинга
	|		КОГДА МаршрутЗадания.Задание = ""Покупка""
	|			ТОГДА &ВидЗаданияВозврат
	|		КОГДА МаршрутЗадания.Задание = ""Комментарий""
	|			ТОГДА &ВидЗаданияКомментарий
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗаданийТорговымПредставителям.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗадания,
	|	ВЫБОР
	|		КОГДА МаршрутЗадания.Задание = ""Покупка""
	|			ТОГДА ""Возврат""
	|		ИНАЧЕ МаршрутЗадания.Задание
	|	КОНЕЦ КАК Задание,
	|	МаршрутЗадания.ШаблонАнкеты,
	|	ЛОЖЬ КАК Обязательное,
	|	0 КАК НомерПосещения,
	|	МаршрутПланПосещений.НомерСтроки КАК НомерСтроки,
	|	0 КАК ПорНомерЗадания
	|ИЗ
	|	Документ.Маршрут.Задания КАК МаршрутЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Маршрут.ПланПосещений КАК МаршрутПланПосещений
	|		ПО МаршрутЗадания.Ссылка = МаршрутПланПосещений.Ссылка
	|			И МаршрутЗадания.ИдентификаторПлана = МаршрутПланПосещений.Идентификатор
	|ГДЕ
	|	МаршрутЗадания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МаршрутЗаданияТП.Контрагент,
	|	ВидыЗаданийТорговымПредставителям.Код,
	|	МаршрутЗаданияТП.Ссылка,
	|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания,
	|	ВидыЗаданийТорговымПредставителям.Наименование + ВЫБОР
	|		КОГДА НЕ ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты ЕСТЬ NULL
	|			ТОГДА "" ("" + ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты.Наименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты ЕСТЬ NULL
	|			ТОГДА ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты
	|		КОГДА ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных
	|			ТОГДА &ШаблонАнкетыАктуализацияКонтактныхДанных
	|		КОГДА НЕ ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты ЕСТЬ NULL
	|			ТОГДА ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ШаблонАнкетыДляТП.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты ЕСТЬ NULL
	|			ТОГДА АнкетаТПНаАктуализациюКонтактныхДанных.Дата ЕСТЬ NULL
	|		ИНАЧЕ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.Обязательное
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МаршрутЗаданияТП.НомерПосещения > 0
	|			ТОГДА МаршрутЗаданияТП.НомерПосещения
	|		ИНАЧЕ 999
	|	КОНЕЦ,
	|	ВидыЗаданийТорговымПредставителям.Код,
	|	ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.НомерСтроки
	|ИЗ
	|	Документ.Маршрут.ЗаданияТП КАК МаршрутЗаданияТП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыПосещенийКлиентовТорговымиПредставителями.ЗаданияТорговомуПредставителю КАК ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаданийТорговымПредставителям КАК ВидыЗаданийТорговымПредставителям
	|			ПО ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = ВидыЗаданийТорговымПредставителям.Ссылка
	|		ПО МаршрутЗаданияТП.ТипПосещения = ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияПоАнкетированиюКлиентов КАК ЗаданияПоАнкетированиюКлиентов
	|		ПО (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАнкета)
	|			И МаршрутЗаданияТП.Контрагент = ЗаданияПоАнкетированиюКлиентов.Контрагент
	|			И МаршрутЗаданияТП.Ссылка.ТорговыйПредставитель = ЗаданияПоАнкетированиюКлиентов.ТорговыйПредставитель
	|			И МаршрутЗаданияТП.Ссылка.Дата >= ЗаданияПоАнкетированиюКлиентов.ДатаНачалаАнкетирования
	|			И (ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты <> &ШаблонАнкетыАктуализацияКонтактныхДанных)
	|			И (МаршрутЗаданияТП.Ссылка.Дата <= КОНЕЦПЕРИОДА(ЗаданияПоАнкетированиюКлиентов.ДатаОкончанияАнкетирования, ДЕНЬ)
	|				ИЛИ ЗаданияПоАнкетированиюКлиентов.ДатаОкончанияАнкетирования = ДАТАВРЕМЯ(1, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АнкетаТП КАК АнкетаТП
	|		ПО (НЕ ЗаданияПоАнкетированиюКлиентов.Контрагент ЕСТЬ NULL)
	|			И (АнкетаТП.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ЗаданияПоАнкетированиюКлиентов.ДатаНачалаАнкетирования, ДЕНЬ) И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(МаршрутЗаданияТП.Ссылка.Дата, ДЕНЬ), СЕКУНДА, -1))
	|			И (НЕ АнкетаТП.ПометкаУдаления)
	|			И МаршрутЗаданияТП.Контрагент = АнкетаТП.Контрагент
	|			И (ЗаданияПоАнкетированиюКлиентов.ШаблонАнкеты = АнкетаТП.ШаблонАнкеты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияПоАнкетированиюКлиентов КАК ЗаданияНаАктуализациюКонтактныхДанных
	|		ПО (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных)
	|			И МаршрутЗаданияТП.Контрагент = ЗаданияНаАктуализациюКонтактныхДанных.Контрагент
	|			И МаршрутЗаданияТП.Ссылка.ТорговыйПредставитель = ЗаданияНаАктуализациюКонтактныхДанных.ТорговыйПредставитель
	|			И МаршрутЗаданияТП.Ссылка.Дата >= ЗаданияНаАктуализациюКонтактныхДанных.ДатаНачалаАнкетирования
	|			И (ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты = &ШаблонАнкетыАктуализацияКонтактныхДанных)
	|			И (МаршрутЗаданияТП.Ссылка.Дата <= ЗаданияНаАктуализациюКонтактныхДанных.ДатаОкончанияАнкетирования
	|				ИЛИ ЗаданияНаАктуализациюКонтактныхДанных.ДатаОкончанияАнкетирования = ДАТАВРЕМЯ(1, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АнкетаТП КАК АнкетаТПНаАктуализациюКонтактныхДанных
	|		ПО (НЕ ЗаданияНаАктуализациюКонтактныхДанных.Контрагент ЕСТЬ NULL)
	|			И (АнкетаТПНаАктуализациюКонтактныхДанных.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ЗаданияНаАктуализациюКонтактныхДанных.ДатаНачалаАнкетирования, ДЕНЬ) И КОНЕЦПЕРИОДА(МаршрутЗаданияТП.Ссылка.Дата, ДЕНЬ))
	|			И (НЕ АнкетаТПНаАктуализациюКонтактныхДанных.ПометкаУдаления)
	|			И МаршрутЗаданияТП.Контрагент = АнкетаТПНаАктуализациюКонтактныхДанных.Контрагент
	|			И (ЗаданияНаАктуализациюКонтактныхДанных.ШаблонАнкеты = АнкетаТПНаАктуализациюКонтактныхДанных.ШаблонАнкеты)
	|ГДЕ
	|	МаршрутЗаданияТП.Ссылка = &Ссылка
	|	И (ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания <> &ВидЗаданияАнкета
	|				И ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания <> &ВидЗаданияАктуализацияКонтактныхДанных
	|			ИЛИ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАнкета
	|				И НЕ ЗаданияПоАнкетированиюКлиентов.Контрагент ЕСТЬ NULL
	|				И АнкетаТП.Дата ЕСТЬ NULL
	|			ИЛИ ТипыПосещенийКлиентовТорговымиПредставителямиЗаданияТорговомуПредставителю.ВидЗадания = &ВидЗаданияАктуализацияКонтактныхДанных
	|				И НЕ ЗаданияНаАктуализациюКонтактныхДанных.Контрагент ЕСТЬ NULL
	|				И АнкетаТПНаАктуализациюКонтактныхДанных.Дата ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Маршрут,
	|	Контрагент,
	|	ПорНомерЗадания,
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.УстановитьПараметр("ВидЗаданияЗаказ", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Заказ"));
	Запрос.УстановитьПараметр("ВидЗаданияФотоФасада", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("ФотоФасада"));
	Запрос.УстановитьПараметр("ВидЗаданияФотоПолкиДоМерчендайзинга", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("ФотоПолкиДоМерчендайзинга"));
	Запрос.УстановитьПараметр("ВидЗаданияФотоПолкиПослеМерчендайзинга", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("ФотоПолкиПослеМерчендайзинга"));
	Запрос.УстановитьПараметр("ВидЗаданияВозврат", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Возврат"));
	Запрос.УстановитьПараметр("ВидЗаданияКомментарий", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Комментарий"));
	
	Запрос.УстановитьПараметр("ВидЗаданияАнкета", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("Анкета"));
	Запрос.УстановитьПараметр("ВидЗаданияАктуализацияКонтактныхДанных", ОбщийМодульПовтИсп.ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных"));
	Запрос.УстановитьПараметр("ШаблонАнкетыАктуализацияКонтактныхДанных", ОбщийМодульПовтИсп.ШаблонАнкетыДляТППолучитьПредопределенныйЭлемент("АктуализацияКонтактныхДанных"));
	
	Движения.ЗаданияТП.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.ЗаданияТП.Записывать = Истина;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Набор = Движения.АктуальныеМаршруты;
	Набор.Очистить();
	Набор.Записывать = Истина;
	
	Набор = Движения.ЗаданияТП;
	Набор.Очистить();
	Набор.Записывать = Истина;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если Не Отказ И Проведен Тогда
		Набор = РегистрыСведений.АктуальныеМаршруты.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Значение = Ссылка;
		Набор.Отбор.Регистратор.Использование = Истина;
		Набор.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
		Набор.Записать( Истина );
		
		Набор = РегистрыСведений.ЗаданияТП.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Значение = Ссылка;
		Набор.Отбор.Регистратор.Использование = Истина;
		Набор.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
		Набор.Записать( Истина );
	КонецЕсли;
КонецПроцедуры
